In [11]:
# Write a Python program to convert a Panda module Series to
# Python list and its type.
import numpy as np
import pandas as pd
c=pd.Series(np.array([1,2,3,4]))
print(c) 
d=c.tolist()
print(d)
print(type(d))

0    1
1    2
2    3
3    4
dtype: int32
[1, 2, 3, 4]
<class 'list'>

In [21]:
# Write a Python program to add, subtract, multiple and divide
# two Pandas Series.
a=pd.Series([1,2,3,4])
b=pd.Series(np.array([9,5,6,7]))
print(a)
print(b)
print('add')
print(np.add(a,b))
print('sub')
print(np.subtract(a,b))
print('div')
print(np.divide(a,b))
print('mul')
print(np.multiply(a,b))

0    1
1    2
2    3
3    4
dtype: int64
0    9
1    5
2    6
3    7
dtype: int32
add
0    10
1     7
2     9
3    11
dtype: int64
sub
0   -8
1   -3
2   -3
3   -3
dtype: int64
div
0    0.111111
1    0.400000
2    0.500000
3    0.571429
dtype: float64
mul
0     9
1    10
2    18
3    28
dtype: int64

In [45]:
# Write a Python program to compare the elements of the two
# Pandas Series.
import pandas as pd
c=pd.Series(np.array([5,6,7]))
print("c is",c)

d=pd.Series(np.array([8,9,10]))
print("d is ",d)
print("c==d",c==d)
print("c<d",c<d)
print("c>d",c>d)
print("c<=d",c<=d)

c is 0    5
1    6
2    7
dtype: int32
d is  0     8
1     9
2    10
dtype: int32
c==d 0    False
1    False
2    False
dtype: bool
c<d 0    True
1    True
2    True
dtype: bool
c>d 0    False
1    False
2    False
dtype: bool
c<=d 0    True
1    True
2    True
dtype: bool

In [169]:
# Write a Python program to create and display a Data Frame
# from a specified dictionary data which has the index labels.
dict1={'student':['vaish','vk','shizuka'],'occupation':['job','student','doctor'],'salary':[100000,200000,400000]}
v=pd.DataFrame(dict1,columns=('student','occupation','salary'),index=range(3))
v

   student occupation  salary
0    vaish        job  100000
1       vk    student  200000
2  shizuka     doctor  400000

In [107]:
# Write a Python program to select the specified columns and
# rows from a given Data Frame.
#v.student
print(v['student'])

0      vaish
1         vk
2    shizuka
Name: student, dtype: object

In [56]:
#rows from a given Data Frame.
v.iloc[1]

student            vk
occupation    student
salary         200000
Name: 1, dtype: object

In [29]:
# Write a Python program to create and display a one-
# dimensional array-like object containing an array of data using

# Pandas module.
c=pd.Series(np.array([1,2,3]))
print(c)
print(type(c))

0    1
1    2
2    3
dtype: int32
<class 'pandas.core.series.Series'>

In [108]:

v['score']=[18,10,20]
v

   student occupation  salary  score
0    vaish        job  100000     18
1       vk    student  200000     10
2  shizuka     doctor  400000     20

In [109]:
# Write a Python program to select the rows the score is between
# 15 and 20 (inclusive).
print(v[v['score'].between(15,20)])

   student occupation  salary  score
0    vaish        job  100000     18
2  shizuka     doctor  400000     20

In [110]:

v['attempts_in_exam']=[1,5,17]

In [111]:
# Write a Python program to select the rows where number of
# attempts in the examination is less than 2 and score greater than 15
print(v[(v['attempts_in_exam']<2) & (v['score']>15)])

  student occupation  salary  score  attempts_in_exam
0   vaish        job  100000     18                 1

In [119]:
v

   student occupation  salary  score  attempts_in_exam
0    vaish        job  100000     18                 1
1       vk    student  200000     10                 5
2  shizuka     doctor  400000     20                17

In [124]:
# Write a Python program to append a new row 'k' to Data Frame
# with given values for each column. Now delete the new row and
# return the original data frame.
v.loc['k'] = ['austin', 'teacher', 8000,17,3]
v

   student occupation  salary  score  attempts_in_exam
0    vaish        job  100000     18                 1
1       vk    student  200000     10                 5
2  shizuka     doctor  400000     20                17
k   austin    teacher    8000     17                 3

In [131]:
v=v.drop('k')

In [132]:
v

   student occupation  salary  score  attempts_in_exam
0    vaish        job  100000     18                 1
1       vk    student  200000     10                 5
2  shizuka     doctor  400000     20                17

In [168]:
# Write a Python program to sort the data frame first by 'name' in
# descending order, then by 'score' in ascending order.

In [137]:
# Write a Python program to insert a new column in existing Data
# Frame
v['area']=['hyd','ny','us']
v

   student occupation  salary  score  attempts_in_exam area
0    vaish        job  100000     18                 1  hyd
1       vk    student  200000     10                 5   ny
2  shizuka     doctor  400000     20                17   us

In [141]:
v.loc['n']=['James','writer',70000,19,2,'karnataka']
v

   student occupation  salary  score  attempts_in_exam       area
0    vaish        job  100000     18                 1        hyd
1       vk    student  200000     10                 5         ny
2  shizuka     doctor  400000     20                17         us
n    James     writer   70000     19                 2  karnataka

In [151]:
v.rename(index={0:'a',1:'b',2:'c','n':'d'},inplace=True)
v

   student occupation  salary  score  attempts_in_exam       area
a    vaish        job  100000     18                 1        hyd
b       vk    student  200000     10                 5         ny
c  shizuka     doctor  400000     20                17         us
d    James     writer   70000     19                 2  karnataka

In [157]:
v['student'].loc['d']='Suresh'
v

C:\Users\890234.CTS\Anaconda3\lib\site-packages\pandas\core\indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

   student occupation  salary  score  attempts_in_exam       area
a    vaish        job  100000     18                 1        hyd
b       vk    student  200000     10                 5         ny
c  shizuka     doctor  400000     20                17         us
d   Suresh     writer   70000     19                 2  karnataka

In [ ]:
#rename(index = {0:'a', 1:'b', 2:'c', 3:'d', 4:'e', 5:'f'}, inplace = True)

In [164]:
print(v.loc[['b','c']])

   student occupation  salary  score  attempts_in_exam area
b       vk    student  200000     10                 5   ny
c  shizuka     doctor  400000     20                17   us

In [166]:
print(v.iloc[1:3])

   student occupation  salary  score  attempts_in_exam area
b       vk    student  200000     10                 5   ny
c  shizuka     doctor  400000     20                17   us

In [167]:
print(v.loc['d'])

student                Suresh
occupation             writer
salary                  70000
score                      19
attempts_in_exam            2
area                karnataka
Name: d, dtype: object